; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite3 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	satellite4 - satellite
	instrument13 - instrument
	instrument14 - instrument
	instrument15 - instrument
	instrument16 - instrument
	instrument17 - instrument
	image4 - mode
	image0 - mode
	infrared3 - mode
	spectrograph1 - mode
	spectrograph2 - mode
	groundstation2 - direction
	star6 - direction
	groundstation9 - direction
	groundstation0 - direction
	groundstation3 - direction
	groundstation11 - direction
	star10 - direction
	groundstation5 - direction
	star1 - direction
	star4 - direction
	groundstation7 - direction
	groundstation8 - direction
	planet12 - direction
	star13 - direction
	phenomenon14 - direction
	star15 - direction
	phenomenon16 - direction
	phenomenon17 - direction
	star18 - direction
	star19 - direction
	star20 - direction
	phenomenon21 - direction
	star22 - direction
	phenomenon23 - direction
	phenomenon24 - direction
	planet25 - direction
	phenomenon26 - direction
	planet27 - direction
	star28 - direction
	planet29 - direction
	planet30 - direction
	planet31 - direction
	phenomenon32 - direction
	planet33 - direction
)
(:init
	(supports instrument0 image4)
	(calibration_target instrument0 star10)
	(calibration_target instrument0 groundstation5)
	(calibration_target instrument0 groundstation7)
	(supports instrument1 image0)
	(supports instrument1 image4)
	(supports instrument1 infrared3)
	(calibration_target instrument1 star10)
	(calibration_target instrument1 groundstation7)
	(calibration_target instrument1 star6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 star4)
	(supports instrument2 image4)
	(supports instrument2 image0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 groundstation2)
	(calibration_target instrument2 star6)
	(calibration_target instrument2 groundstation11)
	(calibration_target instrument2 groundstation5)
	(supports instrument3 spectrograph2)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 star6)
	(calibration_target instrument3 groundstation8)
	(supports instrument4 image0)
	(supports instrument4 spectrograph1)
	(supports instrument4 image4)
	(calibration_target instrument4 groundstation5)
	(calibration_target instrument4 groundstation7)
	(calibration_target instrument4 star10)
	(calibration_target instrument4 groundstation8)
	(supports instrument5 spectrograph2)
	(supports instrument5 infrared3)
	(calibration_target instrument5 groundstation0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 phenomenon23)
	(supports instrument6 spectrograph2)
	(supports instrument6 image4)
	(supports instrument6 infrared3)
	(calibration_target instrument6 groundstation0)
	(calibration_target instrument6 star4)
	(supports instrument7 infrared3)
	(calibration_target instrument7 star10)
	(calibration_target instrument7 groundstation2)
	(calibration_target instrument7 groundstation0)
	(calibration_target instrument7 star4)
	(supports instrument8 spectrograph2)
	(calibration_target instrument8 star10)
	(calibration_target instrument8 groundstation9)
	(supports instrument9 image4)
	(supports instrument9 spectrograph2)
	(calibration_target instrument9 groundstation3)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(on_board instrument9 satellite2)
	(power_avail satellite2)
	(pointing satellite2 planet29)
	(supports instrument10 infrared3)
	(calibration_target instrument10 star10)
	(calibration_target instrument10 groundstation3)
	(supports instrument11 spectrograph1)
	(supports instrument11 image0)
	(supports instrument11 image4)
	(calibration_target instrument11 groundstation9)
	(supports instrument12 spectrograph2)
	(calibration_target instrument12 groundstation9)
	(calibration_target instrument12 groundstation5)
	(calibration_target instrument12 star6)
	(calibration_target instrument12 groundstation2)
	(on_board instrument10 satellite3)
	(on_board instrument11 satellite3)
	(on_board instrument12 satellite3)
	(power_avail satellite3)
	(pointing satellite3 star1)
	(supports instrument13 spectrograph1)
	(supports instrument13 spectrograph2)
	(supports instrument13 image0)
	(calibration_target instrument13 star10)
	(supports instrument14 spectrograph2)
	(calibration_target instrument14 groundstation0)
	(supports instrument15 spectrograph1)
	(supports instrument15 image0)
	(supports instrument15 spectrograph2)
	(calibration_target instrument15 groundstation11)
	(calibration_target instrument15 star1)
	(calibration_target instrument15 groundstation3)
	(supports instrument16 spectrograph1)
	(supports instrument16 infrared3)
	(calibration_target instrument16 groundstation5)
	(calibration_target instrument16 star10)
	(calibration_target instrument16 groundstation8)
	(supports instrument17 spectrograph2)
	(calibration_target instrument17 groundstation8)
	(calibration_target instrument17 groundstation7)
	(calibration_target instrument17 star4)
	(calibration_target instrument17 star1)
	(on_board instrument13 satellite4)
	(on_board instrument14 satellite4)
	(on_board instrument15 satellite4)
	(on_board instrument16 satellite4)
	(on_board instrument17 satellite4)
	(power_avail satellite4)
	(pointing satellite4 phenomenon21)
)
(:goal (and
	(pointing satellite2 phenomenon17)
	(pointing satellite3 phenomenon14)
	(pointing satellite4 phenomenon26)
	(have_image planet12 spectrograph1)
	(have_image star13 infrared3)
	(have_image phenomenon14 spectrograph2)
	(have_image star15 image0)
	(have_image phenomenon16 infrared3)
	(have_image phenomenon17 image4)
	(have_image star18 infrared3)
	(have_image star19 infrared3)
	(have_image star20 spectrograph2)
	(have_image phenomenon21 image0)
	(have_image star22 image4)
	(have_image phenomenon24 infrared3)
	(have_image planet25 image4)
	(have_image phenomenon26 spectrograph1)
	(have_image planet27 spectrograph1)
	(have_image star28 spectrograph1)
	(have_image planet29 infrared3)
	(have_image planet30 image0)
	(have_image planet31 image4)
	(have_image phenomenon32 spectrograph2)
	(have_image planet33 infrared3)
))
(:metric minimize (total-time))

)

; plan
1. (turn_to satellite2 phenomenon17 planet29)
   deleted: (pointing satellite2 planet29)
   added: (pointing satellite2 phenomenon17)
   goals met: 1 of 24
2. (turn_to satellite3 phenomenon14 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 phenomenon14)
   goals met: 2 of 24
3. (turn_to satellite4 phenomenon26 phenomenon21)
   deleted: (pointing satellite4 phenomenon21)
   added: (pointing satellite4 phenomenon26)
   goals met: 3 of 24
4. (switch_on instrument12 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument12)
   goals met: 3 of 24
5. (turn_to satellite3 star6 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 star6)
   goals met: 2 of 24
6. (switch_on instrument16 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument16)
   goals met: 2 of 24
7. (turn_to satellite4 star10 phenomenon26)
   deleted: (pointing satellite4 phenomenon26)
   added: (pointing satellite4 star10)
   goals met: 1 of 24
8. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 1 of 24
9. (turn_to satellite2 groundstation0 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 groundstation0)
   goals met: 0 of 24
10. (turn_to satellite3 phenomenon14 star6)
   deleted: (pointing satellite3 star6)
   added: (pointing satellite3 phenomenon14)
   goals met: 1 of 24
11. (calibrate satellite2 instrument6 groundstation0)
   added: (calibrated instrument6)
   goals met: 1 of 24
12. (turn_to satellite2 phenomenon17 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 phenomenon17)
   goals met: 2 of 24
13. (calibrate satellite4 instrument16 star10)
   added: (calibrated instrument16)
   goals met: 2 of 24
14. (turn_to satellite4 phenomenon26 star10)
   deleted: (pointing satellite4 star10)
   added: (pointing satellite4 phenomenon26)
   goals met: 3 of 24
15. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 24
16. (turn_to satellite0 groundstation7 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 groundstation7)
   goals met: 3 of 24
17. (take_image satellite2 phenomenon17 instrument6 image4)
   added: (have_image phenomenon17 image4)
   goals met: 4 of 24
18. (calibrate satellite0 instrument1 groundstation7)
   added: (calibrated instrument1)
   goals met: 4 of 24
19. (turn_to satellite0 phenomenon21 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 phenomenon21)
   goals met: 4 of 24
20. (take_image satellite4 phenomenon26 instrument16 spectrograph1)
   added: (have_image phenomenon26 spectrograph1)
   goals met: 5 of 24
21. (take_image satellite0 phenomenon21 instrument1 image0)
   added: (have_image phenomenon21 image0)
   goals met: 6 of 24
22. (turn_to satellite2 phenomenon14 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 phenomenon14)
   goals met: 5 of 24
23. (turn_to satellite4 planet12 phenomenon26)
   deleted: (pointing satellite4 phenomenon26)
   added: (pointing satellite4 planet12)
   goals met: 4 of 24
24. (take_image satellite2 phenomenon14 instrument6 spectrograph2)
   added: (have_image phenomenon14 spectrograph2)
   goals met: 5 of 24
25. (turn_to satellite4 phenomenon26 planet12)
   deleted: (pointing satellite4 planet12)
   added: (pointing satellite4 phenomenon26)
   goals met: 6 of 24
26. (turn_to satellite2 phenomenon17 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 phenomenon17)
   goals met: 7 of 24
27. (turn_to satellite0 phenomenon16 phenomenon21)
   deleted: (pointing satellite0 phenomenon21)
   added: (pointing satellite0 phenomenon16)
   goals met: 7 of 24
28. (take_image satellite0 phenomenon16 instrument1 infrared3)
   added: (have_image phenomenon16 infrared3)
   goals met: 8 of 24
29. (turn_to satellite2 phenomenon24 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 phenomenon24)
   goals met: 7 of 24
30. (turn_to satellite4 planet12 phenomenon26)
   deleted: (pointing satellite4 phenomenon26)
   added: (pointing satellite4 planet12)
   goals met: 6 of 24
31. (take_image satellite2 phenomenon24 instrument6 infrared3)
   added: (have_image phenomenon24 infrared3)
   goals met: 7 of 24
32. (turn_to satellite4 phenomenon26 planet12)
   deleted: (pointing satellite4 planet12)
   added: (pointing satellite4 phenomenon26)
   goals met: 8 of 24
33. (turn_to satellite2 phenomenon17 phenomenon24)
   deleted: (pointing satellite2 phenomenon24)
   added: (pointing satellite2 phenomenon17)
   goals met: 9 of 24
34. (turn_to satellite0 planet25 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 planet25)
   goals met: 9 of 24
35. (turn_to satellite4 star28 phenomenon26)
   deleted: (pointing satellite4 phenomenon26)
   added: (pointing satellite4 star28)
   goals met: 8 of 24
36. (take_image satellite4 star28 instrument16 spectrograph1)
   added: (have_image star28 spectrograph1)
   goals met: 9 of 24
37. (turn_to satellite2 phenomenon32 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 phenomenon32)
   goals met: 8 of 24
38. (take_image satellite0 planet25 instrument1 image4)
   added: (have_image planet25 image4)
   goals met: 9 of 24
39. (take_image satellite2 phenomenon32 instrument6 spectrograph2)
   added: (have_image phenomenon32 spectrograph2)
   goals met: 10 of 24
40. (turn_to satellite4 phenomenon26 star28)
   deleted: (pointing satellite4 star28)
   added: (pointing satellite4 phenomenon26)
   goals met: 11 of 24
41. (turn_to satellite0 planet29 planet25)
   deleted: (pointing satellite0 planet25)
   added: (pointing satellite0 planet29)
   goals met: 11 of 24
42. (turn_to satellite2 phenomenon17 phenomenon32)
   deleted: (pointing satellite2 phenomenon32)
   added: (pointing satellite2 phenomenon17)
   goals met: 12 of 24
43. (take_image satellite0 planet29 instrument1 infrared3)
   added: (have_image planet29 infrared3)
   goals met: 13 of 24
44. (turn_to satellite4 planet12 phenomenon26)
   deleted: (pointing satellite4 phenomenon26)
   added: (pointing satellite4 planet12)
   goals met: 12 of 24
45. (take_image satellite4 planet12 instrument16 spectrograph1)
   added: (have_image planet12 spectrograph1)
   goals met: 13 of 24
46. (turn_to satellite2 star20 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 star20)
   goals met: 12 of 24
47. (turn_to satellite0 planet30 planet29)
   deleted: (pointing satellite0 planet29)
   added: (pointing satellite0 planet30)
   goals met: 12 of 24
48. (take_image satellite2 star20 instrument6 spectrograph2)
   added: (have_image star20 spectrograph2)
   goals met: 13 of 24
49. (turn_to satellite4 phenomenon26 planet12)
   deleted: (pointing satellite4 planet12)
   added: (pointing satellite4 phenomenon26)
   goals met: 14 of 24
50. (take_image satellite0 planet30 instrument1 image0)
   added: (have_image planet30 image0)
   goals met: 15 of 24
51. (turn_to satellite2 phenomenon17 star20)
   deleted: (pointing satellite2 star20)
   added: (pointing satellite2 phenomenon17)
   goals met: 16 of 24
52. (turn_to satellite4 planet33 phenomenon26)
   deleted: (pointing satellite4 phenomenon26)
   added: (pointing satellite4 planet33)
   goals met: 15 of 24
53. (turn_to satellite0 star15 planet30)
   deleted: (pointing satellite0 planet30)
   added: (pointing satellite0 star15)
   goals met: 15 of 24
54. (take_image satellite4 planet33 instrument16 infrared3)
   added: (have_image planet33 infrared3)
   goals met: 16 of 24
55. (turn_to satellite2 star13 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 star13)
   goals met: 15 of 24
56. (take_image satellite0 star15 instrument1 image0)
   added: (have_image star15 image0)
   goals met: 16 of 24
57. (take_image satellite2 star13 instrument6 infrared3)
   added: (have_image star13 infrared3)
   goals met: 17 of 24
58. (turn_to satellite4 phenomenon26 planet33)
   deleted: (pointing satellite4 planet33)
   added: (pointing satellite4 phenomenon26)
   goals met: 18 of 24
59. (turn_to satellite0 star18 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star18)
   goals met: 18 of 24
60. (turn_to satellite2 phenomenon17 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 phenomenon17)
   goals met: 19 of 24
61. (take_image satellite0 star18 instrument1 infrared3)
   added: (have_image star18 infrared3)
   goals met: 20 of 24
62. (turn_to satellite4 planet27 phenomenon26)
   deleted: (pointing satellite4 phenomenon26)
   added: (pointing satellite4 planet27)
   goals met: 19 of 24
63. (take_image satellite4 planet27 instrument16 spectrograph1)
   added: (have_image planet27 spectrograph1)
   goals met: 20 of 24
64. (turn_to satellite0 planet31 star18)
   deleted: (pointing satellite0 star18)
   added: (pointing satellite0 planet31)
   goals met: 20 of 24
65. (turn_to satellite4 phenomenon26 planet27)
   deleted: (pointing satellite4 planet27)
   added: (pointing satellite4 phenomenon26)
   goals met: 21 of 24
66. (take_image satellite0 planet31 instrument1 image4)
   added: (have_image planet31 image4)
   goals met: 22 of 24
67. (turn_to satellite0 star19 planet31)
   deleted: (pointing satellite0 planet31)
   added: (pointing satellite0 star19)
   goals met: 22 of 24
68. (take_image satellite0 star19 instrument1 infrared3)
   added: (have_image star19 infrared3)
   goals met: 23 of 24
69. (turn_to satellite2 star22 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 star22)
   goals met: 22 of 24
70. (take_image satellite2 star22 instrument6 image4)
   added: (have_image star22 image4)
   goals met: 23 of 24
71. (turn_to satellite2 phenomenon17 star22)
   deleted: (pointing satellite2 star22)
   added: (pointing satellite2 phenomenon17)
   goals met: 24 of 24
